zhengwang721/ASF/thirdparty/wireless/avr2025_mac/apps/mac/beacon/dev/main.c
static uint8_t APP_TIMER;
#if (defined ENABLE_SLEEP || defined RTC_SLEEP)
#undef SIO_HUB
#endif

#ifdef MAC_SECURITY_ZIP
uint8_t deviceShortAddress = 0xFF;
#endif

/* === PROTOTYPES ========================================================== */

/**
 * @brief Callback function indicating network search
 *
 * @param parameter Pointer to callback parameter
 *                  (not used in this application, but could be if desired).
 */
static void network_search_indication_cb(void *parameter);

/**
 * @brief Callback function for switching off the LED after data reception
 *
 * @param parameter Pointer to callback parameter
 *                  (not used in this application, but could be if desired).
 */
static void rx_data_led_off_cb(void *parameter);

/** Alert to indicate something has gone wrong in the application */
static void app_alert(void);

/* === IMPLEMENTATION ====================================================== */

/**
 * @brief Main function of the device application
 */
int main(void)
{
	
	irq_initialize_vectors();
	#if SAMD20
	system_init();
	delay_init();
	#else
	sysclk_init();

	/* Initialize the board.
	 * The board-specific conf_board.h file contains the configuration of
	 * the board initialization.
	 */
	board_init();    
	#endif
#ifdef SIO_HUB
	sio2host_init(); 
#endif
	sw_timer_init();

	if (MAC_SUCCESS != wpan_init()) {
		app_alert();
	}

	/* Initialize LEDs. */
	LED_On(LED_START);     /* indicating application is started */
	LED_Off(LED_NWK_SETUP); /* indicating network is started */
	LED_Off(LED_DATA);     /* indicating data transmission */
	cpu_irq_enable();
#ifdef SIO_HUB
	/* Initialize the serial interface used for communication with terminal
	 *program. */

	/* To Make sure the Hyper Terminal to the System */
	sio2host_getchar();

	printf("\nBeacon_Application\r\n\n");
	printf("\nDevice\r\n\n");
#endif
    
	sw_timer_get_id(&APP_TIMER);
	
   
	wpan_mlme_reset_req(true);
    #ifdef ENABLE_SLEEP
    sw_timer_get_id(&APP_TIMER_SLEEP);
    #endif
LED_Off(LED_NWK_SETUP);
	while (true) {
		wpan_task();
		#if (defined ENABLE_SLEEP || defined RTC_SLEEP)
		sleep_time = mac_ready_to_sleep();
		if((sleep_time > (uint32_t)APP_GUARD_TIME_US))
		{       
			  
			enter_sleep(sleep_time);
		}
		#endif
	}
}

#if defined(ENABLE_TSTAMP)
/*
 * Callback function usr_mcps_data_conf
 *
 * @param msduHandle  Handle of MSDU handed over to MAC earlier
 * @param status      Result for requested data transmission request
 * @param Timestamp   The time, in symbols, at which the data were transmitted
 *                    (only if time stamping is enabled).
 *
 */
void usr_mcps_data_conf(uint8_t msduHandle,
		uint8_t status,
		uint32_t Timestamp)
#else
void usr_mcps_data_conf(uint8_t msduHandle,
		uint8_t status)
#endif  /* ENABLE_TSTAMP */
{
}

#ifdef GTS_SUPPORT
void usr_mlme_gts_ind(uint16_t DeviceAddr, gts_char_t GtsChar)
{
	
	DeviceAddr = DeviceAddr;
	GtsChar = GtsChar;
}
#endif

#ifdef GTS_SUPPORT
void usr_mlme_gts_conf(gts_char_t GtsChar, uint8_t status)
{   
	GtsChar = GtsChar;
	status = status;
}
#endif

/*
 * @brief Callback function usr_mcps_data_ind
 *
 * @param SrcAddrSpec      Pointer to source address specification
 * @param DstAddrSpec      Pointer to destination address specification
 * @param msduLength       Number of octets contained in MSDU
 * @param msdu             Pointer to MSDU
 * @param mpduLinkQuality  LQI measured during reception of the MPDU
 * @param DSN              DSN of the received data frame.
 * @param Timestamp        The time, in symbols, at which the data were
 *received.
 *                         (only if timestamping is enabled).
 */
#ifdef MAC_SECURITY_ZIP
void usr_mcps_data_ind(wpan_addr_spec_t *SrcAddrSpec,
				wpan_addr_spec_t *DstAddrSpec,
				uint8_t msduLength,
				uint8_t *msdu,
				uint8_t mpduLinkQuality,
				uint8_t DSN,
#ifdef ENABLE_TSTAMP
				uint32_t Timestamp,
				#endif  /* ENABLE_TSTAMP */
				uint8_t SecurityLevel,
				uint8_t KeyIdMode,
				uint8_t KeyIndex)
#else /* No MAC_SECURITY */

void usr_mcps_data_ind(wpan_addr_spec_t *SrcAddrSpec,
		wpan_addr_spec_t *DstAddrSpec,
		uint8_t msduLength,
		uint8_t *msdu,
		uint8_t mpduLinkQuality,
#ifdef ENABLE_TSTAMP
		uint8_t DSN,
		uint32_t Timestamp)
#else
		uint8_t DSN)
#endif  /* ENABLE_TSTAMP */
#endif
{
#ifdef SIO_HUB
	//char sio_array[255];
#ifdef SIO_HUB
const char Display_Received_Frame[] = "Frame received: %lu\r\n";
#endif
#endif

	if (DstAddrSpec->Addr.short_address == BROADCAST) {
		bc_rx_cnt++;
#ifdef SIO_HUB
		printf("Broadcast ");
		printf(Display_Received_Frame, bc_rx_cnt);
#endif
	} else {
		indirect_rx_cnt++;
#ifdef SIO_HUB

		printf("Frame received: ");
		for (uint8_t i = 0; i < msduLength; i++) {
			printf("%c", msdu[i]);
		}
		printf("\n\r");
#endif
	}

	/*
	 * Dummy data has been received successfully.
	 * Application code could be added here ...
	 */
	LED_On(LED_DATA);

	/* Start a timer switching off the LED. */
	sw_timer_start(APP_TIMER,
			500000,
			SW_TIMEOUT_RELATIVE,
			(FUNC_PTR)rx_data_led_off_cb,
			NULL);

	/* Keep compiler happy. */
	SrcAddrSpec = SrcAddrSpec;
	DstAddrSpec = DstAddrSpec;
	msduLength = msduLength;
	msdu = msdu;
	mpduLinkQuality = mpduLinkQuality;
	DSN = DSN;
#ifdef ENABLE_TSTAMP
	Timestamp = Timestamp;
#endif  /* ENABLE_TSTAMP */
}

#if ((MAC_PURGE_REQUEST_CONFIRM == 1) && (MAC_INDIRECT_DATA_BASIC == 1))

/*
 * Callback function usr_mcps_purge_conf
 *
 * @param msduHandle           Handle (id) of MSDU to be purged.
 * @param status               Result of requested purge operation.
 *
 * @return void
 *
 */
void usr_mcps_purge_conf(uint8_t msduHandle,
		uint8_t status)
{
}

#endif  /* ((MAC_PURGE_REQUEST_CONFIRM == 1) && (MAC_INDIRECT_DATA_BASIC == 1))
         **/

#if (MAC_ASSOCIATION_REQUEST_CONFIRM == 1)

/*
 * @brief Callback function usr_mlme_associate_conf
 *
 * @param AssocShortAddress    Short address allocated by the coordinator
 * @param status               Result of requested association operation
 */
void usr_mlme_associate_conf(uint16_t AssocShortAddress,
		uint8_t status)
{
	if (status == MAC_SUCCESS) {
#ifdef SIO_HUB
		printf("Connected to beacon-enabled network\r\n");
#endif
		/* Set proper state of application. */
		app_state = APP_DEVICE_RUNNING;

		/* Stop timer used for search indication */
		sw_timer_stop(APP_TIMER);

		LED_On(LED_NWK_SETUP);
#ifdef MAC_SECURITY_ZIP			
		uint16_t mac_dev_table_entries = 3;

	    wpan_mlme_set_req(macDeviceTableEntries,
	    NO_PIB_INDEX,
	    &mac_dev_table_entries);
#endif
	#ifdef GTS_SUPPORT
		gts_char_t gts_spec;
		gts_spec.GtsLength=2;
		gts_spec.GtsDirection=GTS_RX_SLOT;
		gts_spec.GtsCharType=GTS_ALLOCATE;
		wpan_mlme_gts_req(AssocShortAddress,gts_spec);
		
	#endif

	} else {
		LED_Off(LED_NWK_SETUP);

		/* Set proper state of application. */
		app_state = APP_IDLE;

		/* Something went wrong; restart. */
		wpan_mlme_reset_req(true);
	}

	/* Keep compiler happy. */
	AssocShortAddress = AssocShortAddress;
#ifdef MAC_SECURITY_ZIP
    deviceShortAddress = AssocShortAddress;
#endif
}

#endif  /* (MAC_ASSOCIATION_REQUEST_CONFIRM == 1) */

