zhengwang721/ASF/thirdparty/wireless/avr2025_mac/apps/mac/beacon/dev/main.c
#if (MAC_ASSOCIATION_INDICATION_RESPONSE == 1)

/*
 * @brief Callback function usr_mlme_associate_ind
 *
 * @param DeviceAddress         Extended address of device requesting
 *association
 * @param CapabilityInformation Capabilities of device requesting association
 */
void usr_mlme_associate_ind(uint64_t DeviceAddress,
		uint8_t CapabilityInformation)
{
	/* Keep compiler happy. */
	DeviceAddress = DeviceAddress;
	CapabilityInformation = CapabilityInformation;
}

#endif  /* (MAC_ASSOCIATION_INDICATION_RESPONSE == 1) */

#if (MAC_BEACON_NOTIFY_INDICATION == 1)

/*
 * Callback function usr_mlme_beacon_notify_ind
 *
 * @param BSN            Beacon sequence number.
 * @param PANDescriptor  Pointer to PAN descriptor for received beacon.
 * @param PendAddrSpec   Pending address specification in received beacon.
 * @param AddrList       List of addresses of devices the coordinator has
 *pending data.
 * @param sduLength      Length of beacon payload.
 * @param sdu            Pointer to beacon payload.
 */
void usr_mlme_beacon_notify_ind(uint8_t BSN,
		wpan_pandescriptor_t *PANDescriptor,
		uint8_t PendAddrSpec,
		uint8_t *AddrList,
		uint8_t sduLength,
		uint8_t *sdu)
{
	if (APP_SCAN_DONE == app_state) {
		/* Set proper state of application. */
		app_state = APP_ASSOC_IN_PROGRESS;

		/*
		 * Associate to our coordinator.
		 * Use: bool wpan_mlme_associate_req(uint8_t LogicalChannel,
		 *                                   uint8_t ChannelPage,
		 *                                   wpan_addr_spec_t
		 **CoordAddrSpec,
		 *                                   uint8_t
		 *CapabilityInformation);
		 * This request will cause a mlme associate confirm message ->
		 * usr_mlme_associate_conf.
		 */
		wpan_mlme_associate_req(current_channel,
				current_channel_page,
				&coord_addr_spec,
				WPAN_CAP_ALLOCADDRESS);
	} else if (APP_DEVICE_RUNNING == app_state) {
		/* This is the standard portion once the node is associated
		 * with the application.
		 */

		/*
		 * Extract the beacon payload from our coordinator and feed it
		 *back
		 * to the coordinator via a data frame.
		 */

		/* Use: bool wpan_mcps_data_req(uint8_t SrcAddrMode,
		 *                              wpan_addr_spec_t *DstAddrSpec,
		 *                              uint8_t msduLength,
		 *                              uint8_t *msdu,
		 *                              uint8_t msduHandle,
		 *                              uint8_t TxOptions);
		 *
		 * This request will cause a mcps data confirm message ->
		 * usr_mcps_data_conf
		 */
		if (sduLength > PAYLOAD_LEN) {
			sduLength = PAYLOAD_LEN;
		}

		/* Copy payload from beacon frame. */
		memcpy(&msdu_payload, sdu, sduLength);

		uint8_t src_addr_mode = WPAN_ADDRMODE_SHORT;
		static uint8_t msdu_handle = 0;

		msdu_handle++;      /* Increment handle */
		
#ifdef MAC_SECURITY_ZIP
		wpan_mcps_data_req(src_addr_mode,
				&coord_addr_spec,
				sduLength,  // msduLength
				&msdu_payload[0],
				msdu_handle,
				WPAN_TXOPT_ACK,
				ZIP_SEC_MIN,     // SecurityLevel
				NULL,
				ZIP_KEY_ID_MODE, // KeyIdMode
				deviceShortAddress);  // KeyIndex
#else		
		wpan_mcps_data_req(src_addr_mode,
				&coord_addr_spec,
				sduLength,
				&msdu_payload[0],
				msdu_handle,
				WPAN_TXOPT_ACK);
#endif

#ifdef SIO_HUB
		{
			static uint32_t rx_cnt;
			const char Rx_Beacon_Payload[] = "Rx beacon payload (%lu): ";

			/* Print received payload. */
			rx_cnt++;
			printf(Rx_Beacon_Payload, rx_cnt);

			/* Set last element to 0. */
			if (sduLength == PAYLOAD_LEN) {
				msdu_payload[PAYLOAD_LEN - 1] = '\0';
			} else {
				msdu_payload[sduLength] = '\0';
			}
			
			for (uint8_t i = 0; i < sduLength; i++) {
				printf("%c", msdu_payload[i]);
			}			
			printf("\r\n");
		}
#endif  /* SIO_HUB */
	}

	/* Keep compiler happy. */
	BSN = BSN;
	PANDescriptor = PANDescriptor;
	PendAddrSpec = PendAddrSpec;
	AddrList = AddrList;
}

#endif  /* (MAC_BEACON_NOTIFY_INDICATION == 1) */

#if ((MAC_ORPHAN_INDICATION_RESPONSE == 1) || \
	(MAC_ASSOCIATION_INDICATION_RESPONSE == 1))

/*
 * @brief Callback function usr_mlme_comm_status_ind
 *
 * @param SrcAddrSpec      Pointer to source address specification
 * @param DstAddrSpec      Pointer to destination address specification
 * @param status           Result for related response operation
 */
void usr_mlme_comm_status_ind(wpan_addr_spec_t *SrcAddrSpec,
		wpan_addr_spec_t *DstAddrSpec,
		uint8_t status)
{
	if (status == MAC_SUCCESS) {
		/*
		 * Now the association of the device has been successful and its
		 * information, like address, could  be stored.
		 * But for the sake of simple handling it has been done
		 * during assignment of the short address within the function
		 * assign_new_short_addr()
		 */
	}

	/* Keep compiler happy. */
	SrcAddrSpec = SrcAddrSpec;
	DstAddrSpec = DstAddrSpec;
}

#endif  /* ((MAC_ORPHAN_INDICATION_RESPONSE == 1) ||
         *(MAC_ASSOCIATION_INDICATION_RESPONSE == 1)) */

#if (MAC_DISASSOCIATION_BASIC_SUPPORT == 1)

/*
 * Callback function usr_mlme_disassociate_conf
 *
 * @param status             Result of requested disassociate operation.
 * @param DeviceAddrSpec     Pointer to wpan_addr_spec_t structure for device
 *                           that has either requested disassociation or been
 *                           instructed to disassociate by its coordinator.
 *
 * @return void
 */
void usr_mlme_disassociate_conf(uint8_t status,
		wpan_addr_spec_t *DeviceAddrSpec)
{
}

#endif /* (MAC_DISASSOCIATION_BASIC_SUPPORT == 1)*/

#if (MAC_DISASSOCIATION_BASIC_SUPPORT == 1)

/*
 * Callback function usr_mlme_disassociate_ind
 *
 * @param DeviceAddress        Extended address of device which initiated the
 *                             disassociation request.
 * @param DisassociateReason   Reason for the disassociation. Valid values:
 *                           - @ref WPAN_DISASSOC_BYPARENT,
 *                           - @ref WPAN_DISASSOC_BYCHILD.
 *
 * @return void
 */
void usr_mlme_disassociate_ind(uint64_t DeviceAddress,
		uint8_t DisassociateReason)
{
}

#endif  /* (MAC_DISASSOCIATION_BASIC_SUPPORT == 1) */

