zhengwang721/ASF/thirdparty/wireless/avr2025_mac/apps/mac/beacon/dev/main.c
#if (MAC_GET_SUPPORT == 1)

/*
 * Callback function usr_mlme_get_conf
 *
 * @param status            Result of requested PIB attribute get operation.
 * @param PIBAttribute      Retrieved PIB attribute.
 * @param PIBAttributeIndex Index of the PIB attribute to be read.
 * @param PIBAttributeValue Pointer to data containing retrieved PIB attribute,
 *
 * @return void
 */
void usr_mlme_get_conf(uint8_t status,
			uint8_t PIBAttribute,
#ifdef MAC_SECURITY_ZIP
			uint8_t PIBAttributeIndex,
#endif  /* MAC_SECURITY_ZIP */
			void *PIBAttributeValue)
{
#ifdef MAC_SECURITY_ZIP
mac_key_table_t *key_table = (mac_key_table_t *)PIBAttributeValue;
#endif
	if ((status == MAC_SUCCESS) && (PIBAttribute == phyCurrentPage)) {
        #ifdef HIGH_DATA_RATE_SUPPORT
		current_channel_page = 17;
        #else
		current_channel_page = *(uint8_t *)PIBAttributeValue;
        #endif
#ifdef MAC_SECURITY_ZIP
		wpan_mlme_get_req(phyChannelsSupported,NO_PIB_INDEX);
#else
		wpan_mlme_get_req(phyChannelsSupported);
#endif
	} else if ((status == MAC_SUCCESS) &&
			(PIBAttribute == phyChannelsSupported)) {
		uint8_t index;

		channels_supported = convert_byte_array_to_32_bit(PIBAttributeValue);

		for (index = 0; index < 32; index++) {
			if (channels_supported & (1 << index)) {
				current_channel = index + CHANNEL_OFFSET;
				break;
			}
		}
#ifdef SIO_HUB
		printf("Searching network in Channel - %d\r\n",
				current_channel);
#endif

		/*
		 * Initiate an active scan over all channels to determine
		 * which channel is used by the coordinator.
		 * Use: bool wpan_mlme_scan_req(uint8_t ScanType,
		 *                              uint32_t ScanChannels,
		 *                              uint8_t ScanDuration,
		 *                              uint8_t ChannelPage);
		 *
		 * This request leads to a scan confirm message ->
		 *usr_mlme_scan_conf
		 * Scan for about 50 ms on each channel -> ScanDuration = 1
		 * Scan for about 1/2 second on each channel -> ScanDuration = 5
		 * Scan for about 1 second on each channel -> ScanDuration = 6
		 */
		wpan_mlme_scan_req(MLME_SCAN_TYPE_ACTIVE,
				SCAN_CHANNEL(current_channel),
				SCAN_DURATION_LONG,
				current_channel_page);

		/* Indicate network scanning by a LED flashing. */
		sw_timer_start(APP_TIMER,
				500000,
				SW_TIMEOUT_RELATIVE,
				(FUNC_PTR)network_search_indication_cb,
				NULL);
	}
#ifdef MAC_SECURITY_ZIP		
	else if((status == MAC_SUCCESS) &&
	     (PIBAttribute == macKeyTable)){
			 for (uint8_t i = 0; i < key_table->KeyDeviceListEntries; i++)
			 {
				 if (EMPTY_DEV_HANDLE == (key_table->KeyDeviceList[i].DeviceDescriptorHandle))
				 {
					 key_table->KeyDeviceList[i].DeviceDescriptorHandle = 0x00;
					 key_table->KeyDeviceList[i].UniqueDevice = true;
					 break;
				 }
			 }
			 wpan_mlme_set_req(macKeyTable,	 
			 deviceShortAddress - 1, 		 
			 (uint8_t *)PIBAttributeValue);
		
	}
#endif	
}

#endif  /* (MAC_GET_SUPPORT == 1) */

#if (MAC_ORPHAN_INDICATION_RESPONSE == 1)

/*
 * Callback function usr_mlme_orphan_ind
 *
 * @param OrphanAddress     Address of orphaned device.
 *
 * @return void
 *
 */
void usr_mlme_orphan_ind(uint64_t OrphanAddress)
{
}

#endif  /* (MAC_ORPHAN_INDICATION_RESPONSE == 1) */

#if (MAC_INDIRECT_DATA_BASIC == 1)

/*
 * Callback function that must be implemented by application (NHLE) for MAC
 *service
 * MLME-POLL.confirm.
 *
 * @param status           Result of requested poll operation.
 *
 * @return void
 *
 */
void usr_mlme_poll_conf(uint8_t status)
{
}

#endif  /* (MAC_INDIRECT_DATA_BASIC == 1) */

/*
 * @brief Callback function usr_mlme_reset_conf
 *
 * @param status Result of the reset procedure
 */
void usr_mlme_reset_conf(uint8_t status)
{
	if (status == MAC_SUCCESS) {
#ifdef MAC_SECURITY_ZIP
	/*	wpan_mlme_get_req(phyCurrentPage,NO_PIB_INDEX);*/
		wpan_mlme_set_req(macDefaultKeySource,
		NO_PIB_INDEX,
		&default_key_source);
#else
		wpan_mlme_get_req(phyCurrentPage);
#endif
	} else {
		/* Set proper state of application. */
		app_state = APP_IDLE;

		/* Something went wrong; restart. */
		wpan_mlme_reset_req(true);
	}
}

#if (MAC_RX_ENABLE_SUPPORT == 1)

/*
 * Callback function usr_mlme_rx_enable_conf
 *
 * @param status           Result of requested receiver enable operation.
 *
 * @return void
 */
void usr_mlme_rx_enable_conf(uint8_t status)
{
}

#endif  /* (MAC_RX_ENABLE_SUPPORT == 1) */

#if ((MAC_SCAN_ED_REQUEST_CONFIRM == 1)      ||	\
	(MAC_SCAN_ACTIVE_REQUEST_CONFIRM == 1)  || \
	(MAC_SCAN_PASSIVE_REQUEST_CONFIRM == 1) || \
	(MAC_SCAN_ORPHAN_REQUEST_CONFIRM == 1))

/*
 * @brief Callback function usr_mlme_scan_conf
 *
 * @param status            Result of requested scan operation
 * @param ScanType          Type of scan performed
 * @param ChannelPage       Channel page on which the scan was performed
 * @param UnscannedChannels Bitmap of unscanned channels
 * @param ResultListSize    Number of elements in ResultList
 * @param ResultList        Pointer to array of scan results
 */
void usr_mlme_scan_conf(uint8_t status,
		uint8_t ScanType,
		uint8_t ChannelPage,
		uint32_t UnscannedChannels,
		uint8_t ResultListSize,
		void *ResultList)
{
	if (status == MAC_SUCCESS) {
		wpan_pandescriptor_t *coordinator;
		uint8_t i;

		/*
		 * Analyze the ResultList.
		 * Assume that the first entry of the result list is our
		 *coodinator.
		 */
		coordinator = (wpan_pandescriptor_t *)ResultList;

		for (i = 0; i < ResultListSize; i++) {
			/*
			 * Check if the PAN descriptor belongs to our
			 *coordinator.
			 * Check if coordinator allows association.
			 */
			if ((coordinator->LogicalChannel == current_channel) &&
					(coordinator->ChannelPage ==
					current_channel_page) &&
					(coordinator->CoordAddrSpec.PANId ==
					DEFAULT_PAN_ID) &&
					((coordinator->SuperframeSpec &
					((uint16_t)1 <<
					ASSOC_PERMIT_BIT_POS)) ==
					((uint16_t)1 << ASSOC_PERMIT_BIT_POS))
					) {
				/* Store the coordinator's address information.
				 **/
				coord_addr_spec.AddrMode = WPAN_ADDRMODE_SHORT;
				coord_addr_spec.PANId = DEFAULT_PAN_ID;
				ADDR_COPY_DST_SRC_16(
						coord_addr_spec.Addr.short_address,
						coordinator->CoordAddrSpec.Addr.short_address);
#ifdef SIO_HUB
				printf("Found network\r\n");
#endif

				/* Set proper state of application. */
				app_state = APP_SCAN_DONE;

